{
  "team2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "ARI": 2,
    "ATL": 3,
    "BAL": 4,
    "BUF": 5,
    "CAR": 6,
    "CHI": 7,
    "CIN": 8,
    "CLE": 9,
    "DAL": 10,
    "DEN": 11,
    "DET": 12,
    "GB": 13,
    "HOU": 14,
    "IND": 15,
    "JAX": 16,
    "KC": 17,
    "LAC": 18,
    "LAR": 19,
    "LV": 20,
    "MIA": 21,
    "MIN": 22,
    "NE": 23,
    "NO": 24,
    "NYG": 25,
    "NYJ": 26,
    "PHI": 27,
    "PIT": 28,
    "SEA": 29,
    "SF": 30,
    "TB": 31,
    "TEN": 32,
    "WAS": 33
  },
  "qb2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "00-0019596": 2,
    "00-0020531": 3,
    "00-0021206": 4,
    "00-0022787": 5,
    "00-0022803": 6,
    "00-0022924": 7,
    "00-0022942": 8,
    "00-0023436": 9,
    "00-0023459": 10,
    "00-0023645": 11,
    "00-0023682": 12,
    "00-0025708": 13,
    "00-0026143": 14,
    "00-0026158": 15,
    "00-0026197": 16,
    "00-0026300": 17,
    "00-0026498": 18,
    "00-0026544": 19,
    "00-0026625": 20,
    "00-0026898": 21,
    "00-0027688": 22,
    "00-0027854": 23,
    "00-0027939": 24,
    "00-0027948": 25,
    "00-0027973": 26,
    "00-0028118": 27,
    "00-0028986": 28,
    "00-0029263": 29,
    "00-0029567": 30,
    "00-0029604": 31,
    "00-0029665": 32,
    "00-0029668": 33,
    "00-0029682": 34,
    "00-0029701": 35,
    "00-0030520": 36,
    "00-0030533": 37,
    "00-0030565": 38,
    "00-0031237": 39,
    "00-0031280": 40,
    "00-0031288": 41,
    "00-0031345": 42,
    "00-0031395": 43,
    "00-0031407": 44,
    "00-0031503": 45,
    "00-0031800": 46,
    "00-0032156": 47,
    "00-0032245": 48,
    "00-0032268": 49,
    "00-0032434": 50,
    "00-0032436": 51,
    "00-0032950": 52,
    "00-0033077": 53,
    "00-0033104": 54,
    "00-0033106": 55,
    "00-0033119": 56,
    "00-0033275": 57,
    "00-0033319": 58,
    "00-0033357": 59,
    "00-0033537": 60,
    "00-0033550": 61,
    "00-0033662": 62,
    "00-0033869": 63,
    "00-0033873": 64,
    "00-0033899": 65,
    "00-0033936": 66,
    "00-0033949": 67,
    "00-0033958": 68,
    "00-0034177": 69,
    "00-0034343": 70,
    "00-0034401": 71,
    "00-0034412": 72,
    "00-0034577": 73,
    "00-0034771": 74,
    "00-0034796": 75,
    "00-0034855": 76,
    "00-0034857": 77,
    "00-0034869": 78,
    "00-0034899": 79,
    "00-0034955": 80,
    "00-0035040": 81,
    "00-0035100": 82,
    "00-0035146": 83,
    "00-0035228": 84,
    "00-0035232": 85,
    "00-0035251": 86,
    "00-0035264": 87,
    "00-0035282": 88,
    "00-0035289": 89,
    "00-0035577": 90,
    "00-0035652": 91,
    "00-0035704": 92,
    "00-0035710": 93,
    "00-0035752": 94,
    "00-0035864": 95,
    "00-0035939": 96,
    "00-0035993": 97,
    "00-0036197": 98,
    "00-0036212": 99,
    "00-0036264": 100,
    "00-0036312": 101,
    "00-0036355": 102,
    "00-0036384": 103,
    "00-0036389": 104,
    "00-0036442": 105,
    "00-0036879": 106,
    "00-0036898": 107,
    "00-0036929": 108,
    "00-0036945": 109,
    "00-0036971": 110,
    "00-0036972": 111,
    "00-0037012": 112,
    "00-0037013": 113,
    "00-0037077": 114,
    "00-0037175": 115,
    "00-0037327": 116,
    "00-0037834": 117,
    "00-0038102": 118,
    "00-0038108": 119,
    "00-0038122": 120,
    "00-0038128": 121,
    "00-0038400": 122,
    "00-0038416": 123,
    "00-0038476": 124,
    "00-0038579": 125,
    "00-0038582": 126,
    "00-0038583": 127,
    "00-0038598": 128,
    "00-0038998": 129,
    "00-0039150": 130,
    "00-0039152": 131,
    "00-0039163": 132,
    "00-0039164": 133,
    "00-0039376": 134,
    "00-0039398": 135,
    "00-0039732": 136,
    "00-0039851": 137,
    "00-0039910": 138,
    "00-0039917": 139,
    "00-0039918": 140,
    "00-0039923": 141,
    "00-0040676": 142
  },
  "coach2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "Aaron Glenn": 2,
    "Adam Gase": 3,
    "Andy Reid": 4,
    "Anthony Lynn": 5,
    "Antonio Pierce": 6,
    "Arthur Smith": 7,
    "Ben Johnson": 8,
    "Bill Belichick": 9,
    "Bill Callahan": 10,
    "Bill O'Brien": 11,
    "Brandon Staley": 12,
    "Brian Callahan": 13,
    "Brian Daboll": 14,
    "Brian Flores": 15,
    "Brian Schottenheimer": 16,
    "Bruce Arians": 17,
    "Chris Tabor": 18,
    "Dan Campbell": 19,
    "Dan Quinn": 20,
    "Darrell Bevell": 21,
    "Dave Canales": 22,
    "David Culley": 23,
    "DeMeco Ryans": 24,
    "Dennis Allen": 25,
    "Dirk Koetter": 26,
    "Doug Marrone": 27,
    "Doug Pederson": 28,
    "Frank Reich": 29,
    "Freddie Kitchens": 30,
    "Giff Smith": 31,
    "Gregg Williams": 32,
    "Hue Jackson": 33,
    "Jason Garrett": 34,
    "Jay Gruden": 35,
    "Jay Rosburg": 36,
    "Jeff Saturday": 37,
    "Jerod Mayo": 38,
    "Jim Harbaugh": 39,
    "Joe Judge": 40,
    "Joe Philbin": 41,
    "John Harbaugh": 42,
    "Jon Gruden": 43,
    "Jonathan Gannon": 44,
    "Josh McDaniels": 45,
    "Kellen Moore": 46,
    "Kevin O'Connell": 47,
    "Kevin Stefanski": 48,
    "Kliff Kingsbury": 49,
    "Kyle Shanahan": 50,
    "Liam Coen": 51,
    "Lovie Smith": 52,
    "Marvin Lewis": 53,
    "Matt Eberflus": 54,
    "Matt LaFleur": 55,
    "Matt Nagy": 56,
    "Matt Patricia": 57,
    "Matt Rhule": 58,
    "Mike Macdonald": 59,
    "Mike McCarthy": 60,
    "Mike McDaniel": 61,
    "Mike Tomlin": 62,
    "Mike Vrabel": 63,
    "Mike Zimmer": 64,
    "Nathaniel Hackett": 65,
    "Nick Sirianni": 66,
    "Pat Shurmur": 67,
    "Pete Carroll": 68,
    "Raheem Morris": 69,
    "Rich Bisaccia": 70,
    "Robert Saleh": 71,
    "Romeo Crennel": 72,
    "Ron Rivera": 73,
    "Sean McDermott": 74,
    "Sean McVay": 75,
    "Sean Payton": 76,
    "Shane Steichen": 77,
    "Steve Wilks": 78,
    "Todd Bowles": 79,
    "Urban Meyer": 80,
    "Vance Joseph": 81,
    "Vic Fangio": 82,
    "Zac Taylor": 83
  }
}